Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.9.106/svd/ATSAMA5D24.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>CLASSD</name>
         <version>11283G</version>
         <description>Audio Class D Amplifier (CLASSD)</description>
         <groupName>CLASSD</groupName>
         <prependToName>CLASSD_</prependToName>
         <baseAddress>0xFC048000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0xE8</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>CLASSD</name>
            <value>59</value>
         </interrupt>
         <registers>
            <register>
               <name>CR</name>
               <description>Control Register</description>
               <addressOffset>0x00</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>SWRST</name>
                     <description>Software Reset</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MR</name>
               <description>Mode Register</description>
               <addressOffset>0x04</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>LEN</name>
                     <description>Left Channel Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LMUTE</name>
                     <description>Left Channel Mute</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>REN</name>
                     <description>Right Channel Enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RMUTE</name>
                     <description>Right Channel Mute</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PWMTYP</name>
                     <description>PWM Modulation Type</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NON_OVERLAP</name>
                     <description>Non-Overlapping Enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NOVRVAL</name>
                     <description>Non-Overlapping Value</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>NOVRVALSelect</name>
                        <enumeratedValue>
                           <name>_5NS</name>
                           <description>Non-overlapping time is 5 ns</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_10NS</name>
                           <description>Non-overlapping time is 10 ns</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_15NS</name>
                           <description>Non-overlapping time is 15 ns</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_20NS</name>
                           <description>Non-overlapping time is 20 ns</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTPMR</name>
               <description>Interpolator Mode Register</description>
               <addressOffset>0x08</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ATTL</name>
                     <description>Left Channel Attenuation</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>ATTR</name>
                     <description>Right Channel Attenuation</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>DSPCLKFREQ</name>
                     <description>DSP Clock Frequency</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>DSPCLKFREQSelect</name>
                        <enumeratedValue>
                           <name>_12M288</name>
                           <description>DSP Clock (DSPCLK) is 12.288 MHz.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_11M2896</name>
                           <description>DSP Clock (DSPCLK) is 11.2896 MHz.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DEEMP</name>
                     <description>Enable De-emphasis Filter</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>DEEMPSelect</name>
                        <enumeratedValue>
                           <name>DISABLED</name>
                           <description>De-emphasis filter is disabled.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLED</name>
                           <description>De-emphasis filter is enabled.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SWAP</name>
                     <description>Swap Left and Right Channels</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>SWAPSelect</name>
                        <enumeratedValue>
                           <name>LEFT_ON_LSB</name>
                           <description>Left channel is on CLASSD_THR[15:0], right channel is on CLASSD_THR[31:16].</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RIGHT_ON_LSB</name>
                           <description>Right channel is on CLASSD_THR[15:0], left channel is on CLASSD_THR[31:16].</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FRAME</name>
                     <description>CLASSD Incoming Data Sampling Frequency</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>FRAMESelect</name>
                        <enumeratedValue>
                           <name>FRAME_8K</name>
                           <description>8 kHz</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FRAME_16K</name>
                           <description>16 kHz</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FRAME_32K</name>
                           <description>32 kHz</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FRAME_48K</name>
                           <description>48 kHz</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FRAME_96K</name>
                           <description>96 kHz</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FRAME_22K</name>
                           <description>22.05 kHz</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FRAME_44K</name>
                           <description>44.1 kHz</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FRAME_88K</name>
                           <description>88.2 kHz</description>
                           <value>0x7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>EQCFG</name>
                     <description>Equalization Selection</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>EQCFGSelect</name>
                        <enumeratedValue>
                           <name>FLAT</name>
                           <description>Flat Response</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BBOOST12</name>
                           <description>Bass boost +12 dB</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BBOOST6</name>
                           <description>Bass boost +6 dB</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BCUT12</name>
                           <description>Bass cut -12 dB</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BCUT6</name>
                           <description>Bass cut -6 dB</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MBOOST3</name>
                           <description>Medium boost +3 dB</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MBOOST8</name>
                           <description>Medium boost +8 dB</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MCUT3</name>
                           <description>Medium cut -3 dB</description>
                           <value>0x7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MCUT8</name>
                           <description>Medium cut -8 dB</description>
                           <value>0x8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TBOOST12</name>
                           <description>Treble boost +12 dB</description>
                           <value>0x9</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TBOOST6</name>
                           <description>Treble boost +6 dB</description>
                           <value>0xA</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TCUT12</name>
                           <description>Treble cut -12 dB</description>
                           <value>0xB</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TCUT6</name>
                           <description>Treble cut -6 dB</description>
                           <value>0xC</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MONO</name>
                     <description>Mono Signal</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>MONOSelect</name>
                        <enumeratedValue>
                           <name>DISABLED</name>
                           <description>The signal is sent stereo to the left and right channels.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLED</name>
                           <description>The same signal is sent on both left and right channels. The sent signal is defined by the MONOMODE field value.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MONOMODE</name>
                     <description>Mono Mode Selection</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>MONOMODESelect</name>
                        <enumeratedValue>
                           <name>MONOMIX</name>
                           <description>(left + right) / 2 is sent on both channels</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MONOSAT</name>
                           <description>(left + right) is sent to both channels. If the sum is too high, the result is saturated.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MONOLEFT</name>
                           <description>THR[15:0] is sent on both left and right channels</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MONORIGHT</name>
                           <description>THR[31:16] is sent on both left and right channels</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTSR</name>
               <description>Interpolator Status Register</description>
               <addressOffset>0x0C</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>CFGERR</name>
                     <description>Configuration Error</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>THR</name>
               <description>Transmit Holding Register</description>
               <addressOffset>0x10</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>LDATA</name>
                     <description>Left Channel Data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>RDATA</name>
                     <description>Right Channel Data</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IER</name>
               <description>Interrupt Enable Register</description>
               <addressOffset>0x14</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>DATRDY</name>
                     <description>Data Ready</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IDR</name>
               <description>Interrupt Disable Register</description>
               <addressOffset>0x18</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>DATRDY</name>
                     <description>Data Ready</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IMR</name>
               <description>Interrupt Mask Register</description>
               <addressOffset>0x1C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>DATRDY</name>
                     <description>Data Ready</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ISR</name>
               <description>Interrupt Status Register</description>
               <addressOffset>0x20</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>DATRDY</name>
                     <description>Data Ready</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>WPMR</name>
               <description>Write Protection Mode Register</description>
               <addressOffset>0xE4</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>WPEN</name>
                     <description>Write Protection Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPKEY</name>
                     <description>Write Protection Key</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>24</bitWidth>
                     <enumeratedValues>
                        <name>WPKEYSelect</name>
                        <enumeratedValue>
                           <name>PASSWD</name>
                           <description>Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0.</description>
                           <value>0x434C44</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
