Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.9.106/svd/ATSAMA5D24.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>SFR</name>
         <version>11066S</version>
         <description>Special Function Registers</description>
         <groupName>SFR</groupName>
         <prependToName>SFR_</prependToName>
         <baseAddress>0xF8030000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x98</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>DDRCFG</name>
               <description>DDR Configuration Register</description>
               <addressOffset>0x04</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>FDQIEN</name>
                     <description>Force DDR_DQ Input Buffer Always On</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FDQSIEN</name>
                     <description>Force DDR_DQS Input Buffer Always On</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OHCIICR</name>
               <description>OHCI Interrupt Configuration Register</description>
               <addressOffset>0x10</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>RES0</name>
                     <description>USB PORTx RESET</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RES1</name>
                     <description>USB PORTx RESET</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RES2</name>
                     <description>USB PORTx RESET</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ARIE</name>
                     <description>OHCI Asynchronous Resume Interrupt Enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>APPSTART</name>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SUSPEND_A</name>
                     <description>USB PORT A</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SUSPEND_B</name>
                     <description>USB PORT B</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SUSPEND_C</name>
                     <description>USB PORT C</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UDPPUDIS</name>
                     <description>USB DEVICE PULLUP DISABLE</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HSIC_SEL</name>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OHCIISR</name>
               <description>OHCI Interrupt Status Register</description>
               <addressOffset>0x14</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>RIS0</name>
                     <description>OHCI Resume Interrupt Status Port 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RIS1</name>
                     <description>OHCI Resume Interrupt Status Port 1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RIS2</name>
                     <description>OHCI Resume Interrupt Status Port 2</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SECURE</name>
               <description>Security Configuration Register</description>
               <addressOffset>0x28</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ROM</name>
                     <description>Disable Access to ROM Code</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FUSE</name>
                     <description>Disable Access to Fuse Controller</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>UTMICKTRIM</name>
               <description>UTMI Clock Trimming Register</description>
               <addressOffset>0x30</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>FREQ</name>
                     <description>UTMI Reference Clock Frequency</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>FREQSelect</name>
                        <enumeratedValue>
                           <name>_12</name>
                           <description>12 MHz reference clock</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_16</name>
                           <description>16 MHz reference clock</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_24</name>
                           <description>24 MHz reference clock</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>VBG</name>
                     <description>UTMI Band Gap Voltage Trimming</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>UTMIHSTRIM</name>
               <description>UTMI High-Speed Trimming Register</description>
               <addressOffset>0x34</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>SQUELCH</name>
                     <description>UTMI HS SQUELCH Voltage Trimming</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>DISC</name>
                     <description>UTMI Disconnect Voltage Trimming</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>SLOPE0</name>
                     <description>UTMI HS PORTx Transceiver Slope Trimming</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>SLOPE1</name>
                     <description>UTMI HS PORTx Transceiver Slope Trimming</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>SLOPE2</name>
                     <description>UTMI HS PORTx Transceiver Slope Trimming</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>UTMIFSTRIM</name>
               <description>UTMI Full-Speed Trimming Register</description>
               <addressOffset>0x38</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>RISE</name>
                     <description>FS Transceiver Output Rising Slope Trimming</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>FALL</name>
                     <description>FS Transceiver Output Falling Slope Trimming</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>XCVR</name>
                     <description>FS Transceiver Crossover Voltage Trimming</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>ZN</name>
                     <description>FS Transceiver NMOS Impedance Trimming</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>ZP</name>
                     <description>FS Transceiver PMOS Impedance Trimming</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>UTMISWAP</name>
               <description>UTMI DP/DM Pin Swapping Register</description>
               <addressOffset>0x3C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>PORT0</name>
                     <description>PORT 0 DP/DM Pin Swapping</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>PORT0Select</name>
                        <enumeratedValue>
                           <name>NORMAL</name>
                           <description>DP/DM normal pinout.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SWAPPED</name>
                           <description>DP/DM swapped pinout.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PORT1</name>
                     <description>PORT 1 DP/DM Pin Swapping</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>PORT1Select</name>
                        <enumeratedValue>
                           <name>NORMAL</name>
                           <description>DP/DM normal pinout.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SWAPPED</name>
                           <description>DP/DM swapped pinout.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PORT2</name>
                     <description>PORT 2 DP/DM Pin Swapping</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>PORT2Select</name>
                        <enumeratedValue>
                           <name>NORMAL</name>
                           <description>DP/DM normal pinout.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SWAPPED</name>
                           <description>DP/DM swapped pinout.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>CAN</name>
               <description>CAN Memories Address-based Register</description>
               <addressOffset>0x48</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>EXT_MEM_CAN0_ADDR</name>
                     <description>MSB CAN0 DMA Base Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>EXT_MEM_CAN1_ADDR</name>
                     <description>MSB CAN1 DMA Base Address</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SN0</name>
               <description>Serial Number 0 Register</description>
               <addressOffset>0x4C</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>SN0</name>
                     <description>Serial Number 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SN1</name>
               <description>Serial Number 1 Register</description>
               <addressOffset>0x50</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>SN1</name>
                     <description>Serial Number 1</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>AICREDIR</name>
               <description>AIC Interrupt Redirection Register</description>
               <addressOffset>0x54</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>NSAIC</name>
                     <description>Interrupt Redirection to Non-Secure AIC</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AICREDIRKEY</name>
                     <description>Unlock Key</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>31</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>L2CC_HRAMC</name>
               <description>L2CC_HRAMC1</description>
               <addressOffset>0x58</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>SRAM_SEL</name>
                     <description>SRAM Selector</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>I2SCLKSEL</name>
               <description>I2SC Register</description>
               <addressOffset>0x90</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>CLKSEL0</name>
                     <description>Clock Selection 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CLKSEL1</name>
                     <description>Clock Selection 1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>QSPICLK_REG</name>
               <description>QSPI Clock Pad Supply Select Register</description>
               <addressOffset>0x94</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>SUP_SEL</name>
                     <description>Supply Selection</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
