Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.9.106/svd/ATSAMA5D24.svd
                              <description>FLEXCOM4_TX</description>
                              <value>19</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>FLEXCOM4_RX</name>
                              <description>FLEXCOM4_RX</description>
                              <value>20</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>SSC0_TX</name>
                              <description>SSC0_TX</description>
                              <value>21</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>SSC0_RX</name>
                              <description>SSC0_RX</description>
                              <value>22</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>SSC1_TX</name>
                              <description>SSC1_TX</description>
                              <value>23</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>SSC1_RX</name>
                              <description>SSC1_RX</description>
                              <value>24</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>ADC</name>
                              <description>ADC</description>
                              <value>25</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>AES_TX</name>
                              <description>AES_TX</description>
                              <value>26</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>AES_RX</name>
                              <description>AES_RX</description>
                              <value>27</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TDES_TX</name>
                              <description>TDES_TX</description>
                              <value>28</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TDES_RX</name>
                              <description>TDES_RX</description>
                              <value>29</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>SHA</name>
                              <description>SHA</description>
                              <value>30</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>I2SC0_TX</name>
                              <description>I2SC0_TX</description>
                              <value>31</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>I2SC0_RX</name>
                              <description>I2SC0_RX</description>
                              <value>32</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>I2SC1_TX</name>
                              <description>I2SC1_TX</description>
                              <value>33</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>I2SC1_RX</name>
                              <description>I2SC1_RX</description>
                              <value>34</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>UART0_TX</name>
                              <description>UART0_TX</description>
                              <value>35</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>UART0_RX</name>
                              <description>UART0_RX</description>
                              <value>36</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>UART1_TX</name>
                              <description>UART1_TX</description>
                              <value>37</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>UART1_RX</name>
                              <description>UART1_RX</description>
                              <value>38</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>UART2_TX</name>
                              <description>UART2_TX</description>
                              <value>39</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>UART2_RX</name>
                              <description>UART2_RX</description>
                              <value>40</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>UART3_TX</name>
                              <description>UART3_TX</description>
                              <value>41</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>UART3_RX</name>
                              <description>UART3_RX</description>
                              <value>42</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>UART4_TX</name>
                              <description>UART4_TX</description>
                              <value>43</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>UART4_RX</name>
                              <description>UART4_RX</description>
                              <value>44</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TC0</name>
                              <description>TC0</description>
                              <value>45</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TC1</name>
                              <description>TC1</description>
                              <value>46</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>CLASSD</name>
                              <description>CLASSD</description>
                              <value>47</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>QSPI1_TX</name>
                              <description>QSPI1_TX</description>
                              <value>48</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>QSPI1_RX</name>
                              <description>QSPI1_RX</description>
                              <value>49</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>PDMIC</name>
                              <description>PDMIC</description>
                              <value>50</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>CDS_MSP</name>
                  <description>Channel Data Stride Memory Set Pattern</description>
                  <addressOffset>0x2C</addressOffset>
                  <size>32</size>
                  <fields>
                     <field>
                        <name>SDS_MSP</name>
                        <description>Channel x Source Data stride or Memory Set Pattern</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>16</bitWidth>
                     </field>
                     <field>
                        <name>DDS_MSP</name>
                        <description>Channel x Destination Data Stride or Memory Set Pattern</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>16</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>CSUS</name>
                  <description>Channel Source Microblock Stride</description>
                  <addressOffset>0x30</addressOffset>
                  <size>32</size>
                  <fields>
                     <field>
                        <name>SUBS</name>
                        <description>Channel x Source Microblock Stride</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>24</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>CDUS</name>
                  <description>Channel Destination Microblock Stride</description>
                  <addressOffset>0x34</addressOffset>
                  <size>32</size>
                  <fields>
                     <field>
                        <name>DUBS</name>
                        <description>Channel x Destination Microblock Stride</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>24</bitWidth>
                     </field>
                  </fields>
               </register>
            </cluster>
         </registers>
      </peripheral>
      <peripheral derivedFrom="XDMAC0">
         <name>XDMAC1</name>
         <baseAddress>0xF0004000</baseAddress>
         <interrupt>
            <name>XDMAC1</name>
            <value>7</value>
         </interrupt>
      </peripheral>
   </peripherals>
</device>
